htappen/esp32webcontroller/firmware/src/usb_xinput_gamepad.cpp
#include "usb_xinput_gamepad.h"

#if defined(CONTROLLER_HOST_TRANSPORT_USB_XINPUT)

#include <Arduino.h>
#include <USB.h>

#include <array>
#include <cstring>

#include "common/tusb_common.h"
#include "common/tusb_types.h"
#include "config.h"
#include "device/usbd.h"
#include "device/usbd_pvt.h"
#include "esp32-hal-tinyusb.h"
#include "esp_rom_sys.h"

namespace {
constexpr uint16_t kXbox360Vid = 0x045e;
constexpr uint16_t kXbox360Pid = 0x028e;
constexpr uint8_t kVendorClass = 0xff;
constexpr uint8_t kVendorSubClass = 0xff;
constexpr uint8_t kVendorProtocol = 0xff;
constexpr uint8_t kInterfaceNumber = 0;
constexpr uint8_t kControlPacketLength = 20;
constexpr uint8_t kFeedbackPacketLength = 8;
constexpr uint8_t kEndpointPacketSize = 32;
constexpr uint8_t kEndpointZeroPacketSize = CFG_TUD_ENDPOINT0_SIZE;
constexpr uint16_t kXbox360ConfigurationTotalLength = 0x0099;
constexpr uint16_t kXbox360BcdDevice = 0x0114;
constexpr uint8_t kUsbAttributesBusPoweredRemoteWakeup = 0xa0;
constexpr uint16_t kUsbPowerMilliAmps = 500;
constexpr uint8_t kInterfaceCount = 4;
constexpr uint8_t kManufacturerStringIndex = 0x01;
constexpr uint8_t kProductStringIndex = 0x02;
constexpr uint8_t kSerialStringIndex = 0x03;
constexpr uint8_t kSecurityMethodStringIndex = 0x04;
constexpr uint8_t kLanguageStringIndex = 0x00;
constexpr uint16_t kXbox360InterfaceDescriptorLength = kXbox360ConfigurationTotalLength - TUD_CONFIG_DESC_LEN;

constexpr uint8_t kButtonDu = 0;
constexpr uint8_t kButtonDd = 1;
constexpr uint8_t kButtonDl = 2;
constexpr uint8_t kButtonDr = 3;
constexpr uint8_t kButtonStart = 4;
constexpr uint8_t kButtonBack = 5;
constexpr uint8_t kButtonLs = 6;
constexpr uint8_t kButtonRs = 7;
constexpr uint8_t kButtonLb = 8;
constexpr uint8_t kButtonRb = 9;
constexpr uint8_t kButtonGuide = 10;
constexpr uint8_t kButtonA = 12;
constexpr uint8_t kButtonB = 13;
constexpr uint8_t kButtonX = 14;
constexpr uint8_t kButtonY = 15;

struct __attribute__((packed)) XInputControlReport {
  uint8_t type = 0x00;
  uint8_t size = kControlPacketLength;
  uint16_t buttons = 0;
  uint8_t lt = 0;
  uint8_t rt = 0;
  int16_t lx = 0;
  int16_t ly = 0;
  int16_t rx = 0;
  int16_t ry = 0;
  uint8_t reserved[6] = {};
};

static_assert(sizeof(XInputControlReport) == kControlPacketLength);

XInputControlReport g_report;
bool g_has_sent_non_neutral_report = false;
bool g_has_queued_report = false;
XInputControlReport g_last_queued_report;

struct XInputDriverState {
  bool interfaces_opened = false;
  uint8_t rhport = 0;
  uint8_t primary_interface = 0;
  uint8_t control_in_ep = 0;
  uint8_t control_out_ep = 0;
  uint8_t headset_in_ep = 0;
  uint8_t headset_out_ep = 0;
  uint8_t headset_aux_in_ep = 0;
  uint8_t headset_aux_out_ep = 0;
  uint8_t auxiliary_in_ep = 0;
  bool report_in_flight = false;
  bool report_dirty = false;
  bool host_out_seen = false;
  XInputControlReport pending_report;
  alignas(4) XInputControlReport transfer_report;
  alignas(4) uint8_t control_out_buffer[kEndpointPacketSize] = {};
  alignas(4) uint8_t headset_out_buffer[kEndpointPacketSize] = {};
  alignas(4) uint8_t headset_aux_out_buffer[kEndpointPacketSize] = {};
};

XInputDriverState g_driver_state;
bool g_logged_custom_descriptor = false;
bool g_logged_device_descriptor = false;
bool g_logged_config_descriptor = false;
bool g_logged_string_descriptor[5] = {};
uint32_t g_send_log_count = 0;
uint32_t g_start_transfer_log_count = 0;
uint32_t g_in_xfer_log_count = 0;
uint32_t g_out_xfer_log_count = 0;
uint32_t g_send_attempt_count = 0;
uint32_t g_send_success_count = 0;
uint32_t g_in_xfer_complete_count = 0;
uint32_t g_in_xfer_failure_count = 0;
uint32_t g_out_xfer_complete_count = 0;

constexpr uint32_t kMaxVerboseSendLogs = 24;
constexpr uint32_t kMaxVerboseTransferLogs = 32;

constexpr std::array<uint8_t, kFeedbackPacketLength> kCapabilitiesFeedback = {
    0x00, 0x08, 0x00, 0xff, 0xff, 0x00, 0x00, 0x00,
};

constexpr std::array<uint8_t, kControlPacketLength> kCapabilitiesInputs = {
    0x00, 0x14, 0x3f, 0xf7, 0xff, 0xff, 0x00, 0x00, 0x00, 0x00,
    0xc0, 0xff, 0xc0, 0xff, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
};

constexpr tusb_desc_device_t kXbox360DeviceDescriptor = {
    .bLength = sizeof(tusb_desc_device_t),
    .bDescriptorType = TUSB_DESC_DEVICE,
    .bcdUSB = 0x0200,
    .bDeviceClass = kVendorClass,
    .bDeviceSubClass = kVendorSubClass,
    .bDeviceProtocol = kVendorProtocol,
    .bMaxPacketSize0 = kEndpointZeroPacketSize,
    .idVendor = kXbox360Vid,
    .idProduct = kXbox360Pid,
    .bcdDevice = kXbox360BcdDevice,
    .iManufacturer = kManufacturerStringIndex,
    .iProduct = kProductStringIndex,
    .iSerialNumber = kSerialStringIndex,
    .bNumConfigurations = 0x01,
};

constexpr std::array<uint8_t, kXbox360ConfigurationTotalLength> kXbox360ConfigurationDescriptor = {
    0x09, 0x02, 0x99, 0x00, 0x04, 0x01, 0x00, 0xA0, 0xFA,
    // Interface 0: Control Data
    0x09, 0x04, 0x00, 0x00, 0x02, 0xFF, 0x5D, 0x01, 0x00,
    0x11, 0x21, 0x00, 0x01, 0x01, 0x25, 0x81, 0x14, 0x00, 0x00, 0x00, 0x00, 0x13, 0x01, 0x08, 0x00, 0x00,
    0x07, 0x05, 0x81, 0x03, 0x20, 0x00, 0x04,
    0x07, 0x05, 0x01, 0x03, 0x20, 0x00, 0x08,
    // Interface 1: Headset / expansion
    0x09, 0x04, 0x01, 0x00, 0x04, 0xFF, 0x5D, 0x03, 0x00,
    0x1B, 0x21, 0x00, 0x01, 0x01, 0x01, 0x82, 0x40, 0x01, 0x02, 0x20, 0x16, 0x83, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x16, 0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x07, 0x05, 0x82, 0x03, 0x20, 0x00, 0x02,
    0x07, 0x05, 0x02, 0x03, 0x20, 0x00, 0x04,
    0x07, 0x05, 0x83, 0x03, 0x20, 0x00, 0x40,
    0x07, 0x05, 0x03, 0x03, 0x20, 0x00, 0x10,
    // Interface 2: Auxiliary
    0x09, 0x04, 0x02, 0x00, 0x01, 0xFF, 0x5D, 0x02, 0x00,
    0x09, 0x21, 0x00, 0x01, 0x01, 0x22, 0x84, 0x07, 0x00,
    0x07, 0x05, 0x84, 0x03, 0x20, 0x00, 0x10,
    // Interface 3: Security method
    0x09, 0x04, 0x03, 0x00, 0x00, 0xFF, 0xFD, 0x13, kSecurityMethodStringIndex,
    0x06, 0x41, 0x00, 0x01, 0x01, 0x03,
};

static_assert(kXbox360ConfigurationDescriptor.size() == kXbox360ConfigurationTotalLength);

constexpr const char* kSecurityMethodString =
    "Xbox Security Method 3, Version 1.00, Microsoft Corporation. All rights reserved.";

uint16_t xinputCustomLoadDescriptor(uint8_t* dst, uint8_t* itf);
void xinputDriverInit(void);
void xinputDriverReset(uint8_t rhport);
uint16_t xinputDriverOpen(uint8_t rhport, tusb_desc_interface_t const* desc_intf, uint16_t max_len);
bool xinputDriverControlXfer(uint8_t rhport, uint8_t stage, tusb_control_request_t const* request);
bool xinputDriverXfer(uint8_t rhport, uint8_t ep_addr, xfer_result_t result, uint32_t xferred_bytes);
bool xinputPrimeOutEndpoint(uint8_t rhport, uint8_t ep_addr);
bool xinputStartReportTransfer(void);
bool xinputReportIsNeutral(const XInputControlReport& report);
bool xinputReportsEqual(const XInputControlReport& lhs, const XInputControlReport& rhs);

uint32_t serialFromUuid() {
  uint32_t hash = 2166136261u;
  for (const char* p = config::kDeviceUuid; *p != '\0'; ++p) {
    hash ^= static_cast<uint8_t>(*p);
    hash *= 16777619u;
  }
  return hash;
}

std::array<uint8_t, 4> serialPacket() {
  const uint32_t value = serialFromUuid();
  return {
      static_cast<uint8_t>((value >> 24) & 0xff),
      static_cast<uint8_t>((value >> 16) & 0xff),
      static_cast<uint8_t>((value >> 8) & 0xff),
      static_cast<uint8_t>(value & 0xff),
  };
}

uint16_t buttonsFromReport(const HostInputReport& report) {
  uint16_t buttons = 0;
  if (report.btn.du) buttons |= (1u << kButtonDu);
  if (report.btn.dd) buttons |= (1u << kButtonDd);
  if (report.btn.dl) buttons |= (1u << kButtonDl);
  if (report.btn.dr) buttons |= (1u << kButtonDr);
  if (report.btn.start) buttons |= (1u << kButtonStart);
  if (report.btn.back) buttons |= (1u << kButtonBack);
  if (report.btn.ls) buttons |= (1u << kButtonLs);
  if (report.btn.rs) buttons |= (1u << kButtonRs);
  if (report.btn.lb) buttons |= (1u << kButtonLb);
  if (report.btn.rb) buttons |= (1u << kButtonRb);
  if (report.btn.a) buttons |= (1u << kButtonA);
  if (report.btn.b) buttons |= (1u << kButtonB);
  if (report.btn.x) buttons |= (1u << kButtonX);
  if (report.btn.y) buttons |= (1u << kButtonY);
  (void)kButtonGuide;
  return buttons;
}

