htappen/esp32webcontroller/firmware/src/usb_xinput_gamepad.cpp
bool xinputReportIsNeutral(const XInputControlReport& report) {
  return report.buttons == 0 && report.lt == 0 && report.rt == 0 && report.lx == 0 && report.ly == 0 &&
         report.rx == 0 && report.ry == 0;
}

bool xinputReportsEqual(const XInputControlReport& lhs, const XInputControlReport& rhs) {
  return lhs.buttons == rhs.buttons && lhs.lt == rhs.lt && lhs.rt == rhs.rt && lhs.lx == rhs.lx &&
         lhs.ly == rhs.ly && lhs.rx == rhs.rx && lhs.ry == rhs.ry;
}

uint8_t* outBufferForEndpoint(uint8_t ep_addr) {
  switch (ep_addr) {
    case 0x01:
      return g_driver_state.control_out_buffer;
    case 0x02:
      return g_driver_state.headset_out_buffer;
    case 0x03:
      return g_driver_state.headset_aux_out_buffer;
    default:
      return nullptr;
  }
}

uint16_t interfaceSpanLength(tusb_desc_interface_t const* desc_intf, uint16_t max_len) {
  uint16_t consumed = 0;
  const uint8_t first_interface = desc_intf->bInterfaceNumber;
  auto const* desc = reinterpret_cast<uint8_t const*>(desc_intf);

  while (consumed < max_len) {
    const uint8_t len = tu_desc_len(desc);
    if (len == 0 || consumed + len > max_len) {
      return 0;
    }

    if (consumed != 0 && tu_desc_type(desc) == TUSB_DESC_INTERFACE) {
      const auto* next_interface = reinterpret_cast<tusb_desc_interface_t const*>(desc);
      if (next_interface->bInterfaceNumber >= static_cast<uint8_t>(first_interface + kInterfaceCount)) {
        break;
      }
    }

    consumed = static_cast<uint16_t>(consumed + len);
    desc = tu_desc_next(desc);
  }

  return consumed;
}

bool xinputUsbInit() {
  static bool initialized = false;
  if (initialized) {
    return true;
  }
  if (tinyusb_enable_interface(USB_INTERFACE_CUSTOM, kXbox360InterfaceDescriptorLength, xinputCustomLoadDescriptor) !=
      ESP_OK) {
    esp_rom_printf("USBX: tinyusb_enable_interface failed\n");
    return false;
  }
  initialized = true;
  USB.VID(kXbox360Vid);
  USB.PID(kXbox360Pid);
  USB.firmwareVersion(kXbox360BcdDevice);
  USB.usbVersion(0x0200);
  USB.usbClass(kVendorClass);
  USB.usbSubClass(kVendorSubClass);
  USB.usbProtocol(kVendorProtocol);
  USB.usbAttributes(kUsbAttributesBusPoweredRemoteWakeup);
  USB.usbPower(kUsbPowerMilliAmps);
  USB.productName("Controller");
  USB.manufacturerName("Microsoft");
  USB.serialNumber(config::kDeviceUuid);
  return true;
}

uint16_t copyUtf16StringDescriptor(const char* value, uint16_t* dst) {
  size_t length = strlen(value);
  if (length > 126) {
    length = 126;
  }
  dst[0] = static_cast<uint16_t>((TUSB_DESC_STRING << 8) | (2 * length + 2));
  for (size_t i = 0; i < length; ++i) {
    dst[1 + i] = value[i];
  }
  return dst[0];
}

uint16_t xinputCustomLoadDescriptor(uint8_t* dst, uint8_t* itf) {
  if (!g_logged_custom_descriptor) {
    esp_rom_printf("USBX: load custom descriptor itf=%u add=%u\n", static_cast<unsigned>(*itf),
                   static_cast<unsigned>(kInterfaceCount));
    g_logged_custom_descriptor = true;
  }
  *itf = static_cast<uint8_t>(*itf + kInterfaceCount);
  memcpy(dst, kXbox360ConfigurationDescriptor.data() + TUD_CONFIG_DESC_LEN, kXbox360InterfaceDescriptorLength);
  return kXbox360InterfaceDescriptorLength;
}

bool xinputPrimeOutEndpoint(uint8_t rhport, uint8_t ep_addr) {
  uint8_t* buffer = outBufferForEndpoint(ep_addr);
  if (buffer == nullptr) {
    return false;
  }
  const bool queued = usbd_edpt_xfer(rhport, ep_addr, buffer, sizeof(g_driver_state.control_out_buffer));
  if (g_out_xfer_log_count < kMaxVerboseTransferLogs) {
    esp_rom_printf("USBX: prime out ep=0x%02x queued=%u\n", static_cast<unsigned>(ep_addr), queued ? 1u : 0u);
  }
  return queued;
}

bool xinputStartReportTransfer() {
  if (!g_driver_state.interfaces_opened || g_driver_state.control_in_ep == 0 || g_driver_state.report_in_flight ||
      !g_driver_state.host_out_seen) {
    if (g_start_transfer_log_count < kMaxVerboseTransferLogs) {
      esp_rom_printf("USBX: start xfer blocked open=%u in_ep=0x%02x inflight=%u dirty=%u out_seen=%u\n",
                     g_driver_state.interfaces_opened ? 1u : 0u, static_cast<unsigned>(g_driver_state.control_in_ep),
                     g_driver_state.report_in_flight ? 1u : 0u, g_driver_state.report_dirty ? 1u : 0u,
                     g_driver_state.host_out_seen ? 1u : 0u);
      ++g_start_transfer_log_count;
    }
    return false;
  }

  const bool tud_is_ready = tud_ready();
  const bool ep_ready = tud_is_ready && usbd_edpt_ready(g_driver_state.rhport, g_driver_state.control_in_ep);
  if (!tud_is_ready || !ep_ready) {
    if (g_start_transfer_log_count < kMaxVerboseTransferLogs) {
      esp_rom_printf("USBX: start xfer not ready tud=%u ep=0x%02x ep_ready=%u dirty=%u\n", tud_is_ready ? 1u : 0u,
                     static_cast<unsigned>(g_driver_state.control_in_ep), ep_ready ? 1u : 0u,
                     g_driver_state.report_dirty ? 1u : 0u);
      ++g_start_transfer_log_count;
    }
    return false;
  }

  g_driver_state.transfer_report = g_driver_state.pending_report;
  g_driver_state.report_in_flight = usbd_edpt_xfer(g_driver_state.rhport, g_driver_state.control_in_ep,
                                                   reinterpret_cast<uint8_t*>(&g_driver_state.transfer_report),
                                                   sizeof(g_driver_state.transfer_report));
  if (g_start_transfer_log_count < kMaxVerboseTransferLogs) {
    esp_rom_printf("USBX: start xfer ep=0x%02x queued=%u buttons=0x%04x lt=%u rt=%u lx=%d ly=%d rx=%d ry=%d\n",
                   static_cast<unsigned>(g_driver_state.control_in_ep), g_driver_state.report_in_flight ? 1u : 0u,
                   static_cast<unsigned>(g_driver_state.transfer_report.buttons),
                   static_cast<unsigned>(g_driver_state.transfer_report.lt),
                   static_cast<unsigned>(g_driver_state.transfer_report.rt), g_driver_state.transfer_report.lx,
                   g_driver_state.transfer_report.ly, g_driver_state.transfer_report.rx, g_driver_state.transfer_report.ry);
    ++g_start_transfer_log_count;
  }
  if (g_driver_state.report_in_flight) {
    g_driver_state.report_dirty = false;
    g_last_queued_report = g_driver_state.transfer_report;
    g_has_queued_report = true;
    ++g_send_success_count;
    if (!xinputReportIsNeutral(g_driver_state.transfer_report)) {
      g_has_sent_non_neutral_report = true;
    }
  }
  return g_driver_state.report_in_flight;
}

void xinputDriverInit(void) {
  g_driver_state = XInputDriverState{};
  g_logged_custom_descriptor = false;
  g_logged_device_descriptor = false;
  g_logged_config_descriptor = false;
  memset(g_logged_string_descriptor, 0, sizeof(g_logged_string_descriptor));
  g_send_log_count = 0;
  g_start_transfer_log_count = 0;
  g_in_xfer_log_count = 0;
  g_out_xfer_log_count = 0;
  g_send_attempt_count = 0;
  g_send_success_count = 0;
  g_in_xfer_complete_count = 0;
  g_in_xfer_failure_count = 0;
  g_out_xfer_complete_count = 0;
  g_has_sent_non_neutral_report = false;
  g_has_queued_report = false;
  g_last_queued_report = XInputControlReport{};
}

void xinputDriverReset(uint8_t rhport) {
  (void)rhport;
  xinputDriverInit();
}

uint16_t xinputDriverOpen(uint8_t rhport, tusb_desc_interface_t const* desc_intf, uint16_t max_len) {
  esp_rom_printf("USBX: driver open cls=%u sub=%u proto=%u itf=%u len=%u\n",
                 static_cast<unsigned>(desc_intf->bInterfaceClass),
                 static_cast<unsigned>(desc_intf->bInterfaceSubClass),
                 static_cast<unsigned>(desc_intf->bInterfaceProtocol),
                 static_cast<unsigned>(desc_intf->bInterfaceNumber), static_cast<unsigned>(max_len));
  if (desc_intf->bInterfaceClass != kVendorClass || desc_intf->bInterfaceSubClass != 0x5d ||
      desc_intf->bInterfaceProtocol != 0x01) {
    esp_rom_printf("USBX: driver open rejected\n");
    return 0;
  }

