htappen/esp32webcontroller/firmware/src/usb_xinput_gamepad.cpp
  const uint16_t span_len = interfaceSpanLength(desc_intf, max_len);
  if (span_len == 0) {
    esp_rom_printf("USBX: driver open span=0\n");
    return 0;
  }

  g_driver_state = XInputDriverState{};
  g_driver_state.interfaces_opened = true;
  g_driver_state.rhport = rhport;
  g_driver_state.primary_interface = desc_intf->bInterfaceNumber;

  auto const* desc = reinterpret_cast<uint8_t const*>(desc_intf);
  const auto* const end = desc + span_len;
  uint8_t current_interface = desc_intf->bInterfaceNumber;

  while (desc < end) {
    const uint8_t type = tu_desc_type(desc);

    if (type == TUSB_DESC_INTERFACE) {
      current_interface = reinterpret_cast<tusb_desc_interface_t const*>(desc)->bInterfaceNumber;
    } else if (type == TUSB_DESC_ENDPOINT) {
      auto const* ep_desc = reinterpret_cast<tusb_desc_endpoint_t const*>(desc);
      if (!usbd_edpt_open(rhport, ep_desc)) {
        g_driver_state.interfaces_opened = false;
        esp_rom_printf("USBX: ep open failed addr=0x%02x\n", static_cast<unsigned>(ep_desc->bEndpointAddress));
        return 0;
      }

      switch (current_interface) {
        case 0:
          if (tu_edpt_dir(ep_desc->bEndpointAddress) == TUSB_DIR_IN) {
            g_driver_state.control_in_ep = ep_desc->bEndpointAddress;
          } else {
            g_driver_state.control_out_ep = ep_desc->bEndpointAddress;
          }
          break;
        case 1:
          if (tu_edpt_dir(ep_desc->bEndpointAddress) == TUSB_DIR_IN) {
            if (g_driver_state.headset_in_ep == 0) {
              g_driver_state.headset_in_ep = ep_desc->bEndpointAddress;
            } else {
              g_driver_state.headset_aux_in_ep = ep_desc->bEndpointAddress;
            }
          } else {
            if (g_driver_state.headset_out_ep == 0) {
              g_driver_state.headset_out_ep = ep_desc->bEndpointAddress;
            } else {
              g_driver_state.headset_aux_out_ep = ep_desc->bEndpointAddress;
            }
          }
          break;
        case 2:
          if (tu_edpt_dir(ep_desc->bEndpointAddress) == TUSB_DIR_IN) {
            g_driver_state.auxiliary_in_ep = ep_desc->bEndpointAddress;
          }
          break;
        default:
          break;
      }
    }

    desc = tu_desc_next(desc);
  }

  xinputPrimeOutEndpoint(rhport, g_driver_state.control_out_ep);
  xinputPrimeOutEndpoint(rhport, g_driver_state.headset_out_ep);
  xinputPrimeOutEndpoint(rhport, g_driver_state.headset_aux_out_ep);
  esp_rom_printf(
      "USBX: driver open ok span=%u in=0x%02x out=0x%02x hs_in=0x%02x hs_out=0x%02x aux=0x%02x\n",
      static_cast<unsigned>(span_len), static_cast<unsigned>(g_driver_state.control_in_ep),
      static_cast<unsigned>(g_driver_state.control_out_ep), static_cast<unsigned>(g_driver_state.headset_in_ep),
      static_cast<unsigned>(g_driver_state.headset_out_ep), static_cast<unsigned>(g_driver_state.auxiliary_in_ep));
  return span_len;
}

bool xinputDriverControlXfer(uint8_t rhport, uint8_t stage, tusb_control_request_t const* request) {
  if (stage != CONTROL_STAGE_SETUP) {
    return true;
  }

  if (request->bmRequestType_bit.type != TUSB_REQ_TYPE_VENDOR || request->bRequest != 0x01) {
    esp_rom_printf("USBX: ctrl unsupported bm=0x%02x req=0x%02x val=0x%04x idx=0x%04x len=%u\n",
                   static_cast<unsigned>(request->bmRequestType), static_cast<unsigned>(request->bRequest),
                   static_cast<unsigned>(request->wValue), static_cast<unsigned>(request->wIndex),
                   static_cast<unsigned>(request->wLength));
    return false;
  }

  esp_rom_printf("USBX: ctrl bm=0x%02x req=0x%02x val=0x%04x idx=0x%04x len=%u\n",
                 static_cast<unsigned>(request->bmRequestType), static_cast<unsigned>(request->bRequest),
                 static_cast<unsigned>(request->wValue), static_cast<unsigned>(request->wIndex),
                 static_cast<unsigned>(request->wLength));

  if (request->bmRequestType_bit.direction == TUSB_DIR_IN) {
    if (request->wValue == 0x0000 && request->wIndex == 0x0000) {
      if (request->bmRequestType == 0xc0) {
        alignas(4) static auto serial = serialPacket();
        return tud_control_xfer(rhport, request, serial.data(), serial.size());
      }

      if (request->bmRequestType == 0xc1) {
        alignas(4) static uint8_t sram_feedback[kFeedbackPacketLength];
        memcpy(sram_feedback, kCapabilitiesFeedback.data(), kCapabilitiesFeedback.size());
        return tud_control_xfer(rhport, request, sram_feedback, kCapabilitiesFeedback.size());
      }
    }

    if (request->bmRequestType == 0xc1 && request->wValue == 0x0100) {
      // Must copy from DROM (Flash) to SRAM for DWC2 DMA
      alignas(4) static uint8_t sram_capabilities[kControlPacketLength];
      memcpy(sram_capabilities, kCapabilitiesInputs.data(), kCapabilitiesInputs.size());
      return tud_control_xfer(rhport, request, sram_capabilities, kCapabilitiesInputs.size());
    }

    return false;
  }

  return tud_control_status(rhport, request);
}

bool xinputDriverXfer(uint8_t rhport, uint8_t ep_addr, xfer_result_t result, uint32_t xferred_bytes) {
  if (!g_driver_state.interfaces_opened || result != XFER_RESULT_SUCCESS) {
    if (ep_addr == g_driver_state.control_in_ep) {
      g_driver_state.report_in_flight = false;
      ++g_in_xfer_failure_count;
      if (g_in_xfer_log_count < kMaxVerboseTransferLogs) {
        esp_rom_printf("USBX: in xfer incomplete ep=0x%02x result=%u bytes=%u dirty=%u\n",
                       static_cast<unsigned>(ep_addr), static_cast<unsigned>(result),
                       static_cast<unsigned>(xferred_bytes), g_driver_state.report_dirty ? 1u : 0u);
        ++g_in_xfer_log_count;
      }
    } else if (tu_edpt_dir(ep_addr) == TUSB_DIR_OUT) {
      if (g_out_xfer_log_count < kMaxVerboseTransferLogs) {
        const uint8_t* buffer = outBufferForEndpoint(ep_addr);
        esp_rom_printf("USBX: out xfer incomplete ep=0x%02x result=%u bytes=%u data=%02x %02x %02x %02x\n",
                       static_cast<unsigned>(ep_addr), static_cast<unsigned>(result),
                       static_cast<unsigned>(xferred_bytes), buffer != nullptr ? buffer[0] : 0u,
                       buffer != nullptr ? buffer[1] : 0u, buffer != nullptr ? buffer[2] : 0u,
                       buffer != nullptr ? buffer[3] : 0u);
        ++g_out_xfer_log_count;
      }
      xinputPrimeOutEndpoint(rhport, ep_addr);
    }
    return true;
  }

