htappen/esp32webcontroller/firmware/src/usb_xinput_gamepad.cpp
  if (ep_addr == g_driver_state.control_in_ep) {
    g_driver_state.report_in_flight = false;
    ++g_in_xfer_complete_count;
    if (g_in_xfer_log_count < kMaxVerboseTransferLogs) {
      esp_rom_printf("USBX: in xfer complete ep=0x%02x bytes=%u dirty=%u success=%u/%u\n",
                     static_cast<unsigned>(ep_addr), static_cast<unsigned>(xferred_bytes),
                     g_driver_state.report_dirty ? 1u : 0u, static_cast<unsigned>(g_send_success_count),
                     static_cast<unsigned>(g_send_attempt_count));
      ++g_in_xfer_log_count;
    }
    return true;
  }

  if (tu_edpt_dir(ep_addr) == TUSB_DIR_OUT) {
    ++g_out_xfer_complete_count;
    if (ep_addr == g_driver_state.control_out_ep) {
      g_driver_state.host_out_seen = true;
    }
    if (g_out_xfer_log_count < kMaxVerboseTransferLogs) {
      const uint8_t* buffer = outBufferForEndpoint(ep_addr);
      esp_rom_printf("USBX: out xfer complete ep=0x%02x bytes=%u data=%02x %02x %02x %02x %02x %02x %02x %02x\n",
                     static_cast<unsigned>(ep_addr), static_cast<unsigned>(xferred_bytes),
                     buffer != nullptr ? buffer[0] : 0u, buffer != nullptr ? buffer[1] : 0u,
                     buffer != nullptr ? buffer[2] : 0u, buffer != nullptr ? buffer[3] : 0u,
                     buffer != nullptr ? buffer[4] : 0u, buffer != nullptr ? buffer[5] : 0u,
                     buffer != nullptr ? buffer[6] : 0u, buffer != nullptr ? buffer[7] : 0u);
      ++g_out_xfer_log_count;
    }
    xinputPrimeOutEndpoint(rhport, ep_addr);
    if (g_driver_state.report_dirty && ep_addr == g_driver_state.control_out_ep) {
      xinputStartReportTransfer();
    }
  }

  return true;
}
}  // namespace

extern "C" uint8_t const* tud_descriptor_device_cb(void) {
  if (!g_logged_device_descriptor) {
    esp_rom_printf("USBX: device descriptor cb\n");
    g_logged_device_descriptor = true;
  }
  return reinterpret_cast<uint8_t const*>(&kXbox360DeviceDescriptor);
}

extern "C" uint8_t const* tud_descriptor_configuration_cb(uint8_t index) {
  if (!g_logged_config_descriptor) {
    esp_rom_printf("USBX: config descriptor cb index=%u\n", static_cast<unsigned>(index));
    g_logged_config_descriptor = true;
  }
  (void)index;
  return kXbox360ConfigurationDescriptor.data();
}

extern "C" uint16_t const* tud_descriptor_string_cb(uint8_t index, uint16_t langid) {
  (void)langid;
  static uint16_t descriptor[127];

  if (index < sizeof(g_logged_string_descriptor) && !g_logged_string_descriptor[index]) {
    esp_rom_printf("USBX: string descriptor cb index=%u\n", static_cast<unsigned>(index));
    g_logged_string_descriptor[index] = true;
  }

  if (index == kLanguageStringIndex) {
    descriptor[0] = static_cast<uint16_t>((TUSB_DESC_STRING << 8) | 4);
    descriptor[1] = 0x0409;
    return descriptor;
  }

  const char* value = nullptr;
  switch (index) {
    case kManufacturerStringIndex:
      value = "Microsoft";
      break;
    case kProductStringIndex:
      value = "Controller";
      break;
    case kSerialStringIndex:
      value = config::kDeviceUuid;
      break;
    case kSecurityMethodStringIndex:
      value = kSecurityMethodString;
      break;
    default:
      return nullptr;
  }

  copyUtf16StringDescriptor(value, descriptor);
  return descriptor;
}

extern "C" usbd_class_driver_t const* usbd_app_driver_get_cb(uint8_t* driver_count) {
  static usbd_class_driver_t const kXInputDriver = {
#if CFG_TUSB_DEBUG >= CFG_TUD_LOG_LEVEL
      "xinput",
#endif
      xinputDriverInit,
      xinputDriverReset,
      xinputDriverOpen,
      xinputDriverControlXfer,
      xinputDriverXfer,
      nullptr,
  };

  *driver_count = 1;
  return &kXInputDriver;
}

bool UsbXInputGamepadBridge::begin() {
  for (uint32_t elapsed = 0; elapsed < config::kUsbXInputBootLogDelayMs; elapsed += config::kUsbXInputBootLogStepMs) {
    delay(config::kUsbXInputBootLogStepMs);
  }
  if (config::kUsbXInputDeferBegin) {
    esp_rom_printf("USBX: begin defer=1\n");
    deferred_start_ = true;
    return true;
  }
  esp_rom_printf("USBX: before xinputUsbInit\n");
  if (!xinputUsbInit()) {
    esp_rom_printf("USBX: xinputUsbInit failed\n");
    return false;
  }
  esp_rom_printf("USBX: after xinputUsbInit\n");
  esp_rom_printf("USBX: before USB.begin\n");
  USB.begin();
  esp_rom_printf("USBX: after USB.begin\n");
  started_ = true;
  g_report = XInputControlReport{};
  esp_rom_printf("USBX: begin complete\n");
  return true;
}

void UsbXInputGamepadBridge::loop() {}

bool UsbXInputGamepadBridge::resetConnection() {
  return false;
}

bool UsbXInputGamepadBridge::setPairingEnabled(bool enabled) {
  (void)enabled;
  return false;
}

bool UsbXInputGamepadBridge::send(const HostInputReport& report) {
  ++g_send_attempt_count;
  const bool tud_is_ready = tud_ready();
  const bool ep_ready = g_driver_state.interfaces_opened && g_driver_state.control_in_ep != 0 &&
                        usbd_edpt_ready(g_driver_state.rhport, g_driver_state.control_in_ep);
  if (!started_ || deferred_start_ || !g_driver_state.interfaces_opened || !tud_is_ready) {
    if (g_send_log_count < kMaxVerboseSendLogs) {
      esp_rom_printf("USBX: send blocked started=%u deferred=%u open=%u tud=%u in_ep=0x%02x ep_ready=%u\n",
                     started_ ? 1u : 0u, deferred_start_ ? 1u : 0u, g_driver_state.interfaces_opened ? 1u : 0u,
                     tud_is_ready ? 1u : 0u, static_cast<unsigned>(g_driver_state.control_in_ep), ep_ready ? 1u : 0u);
      ++g_send_log_count;
    }
    return false;
  }

  g_report.buttons = buttonsFromReport(report);
  g_report.lt = report.lt;
  g_report.rt = report.rt;
  g_report.lx = report.lx;
  g_report.ly = report.ly;
  g_report.rx = report.rx;
  g_report.ry = report.ry;

  const bool neutral = xinputReportIsNeutral(g_report);
  if (neutral && !g_has_sent_non_neutral_report) {
    if (g_send_log_count < kMaxVerboseSendLogs) {
      esp_rom_printf("USBX: send skipped initial neutral report\n");
      ++g_send_log_count;
    }
    return true;
  }
  if (g_driver_state.report_in_flight && xinputReportsEqual(g_report, g_driver_state.transfer_report)) {
    return true;
  }
  if (g_driver_state.report_dirty && xinputReportsEqual(g_report, g_driver_state.pending_report)) {
    if (!g_driver_state.report_in_flight) {
      return xinputStartReportTransfer();
    }
    return true;
  }
  if (!g_driver_state.report_in_flight && g_has_queued_report && xinputReportsEqual(g_report, g_last_queued_report)) {
    return true;
  }

  g_driver_state.pending_report = g_report;
  g_driver_state.report_dirty = true;
  const bool queued = xinputStartReportTransfer();
  if (g_send_log_count < kMaxVerboseSendLogs) {
    esp_rom_printf("USBX: send queued=%u buttons=0x%04x lt=%u rt=%u lx=%d ly=%d rx=%d ry=%d ep_ready=%u\n",
                   queued ? 1u : 0u, static_cast<unsigned>(g_report.buttons), static_cast<unsigned>(g_report.lt),
                   static_cast<unsigned>(g_report.rt), g_report.lx, g_report.ly, g_report.rx, g_report.ry,
                   ep_ready ? 1u : 0u);
    ++g_send_log_count;
  }
  return queued;
}

HostStatus UsbXInputGamepadBridge::status() const {
  HostStatus status;
  status.transport = "usb";
  status.variant = "pc";
  status.display_name = config::kUsbXInputProductName;
  status.ready = started_ && !deferred_start_ && g_driver_state.interfaces_opened;
  status.connected = started_ && !deferred_start_ && tud_mounted();
  status.supports_pairing = false;
  status.pairing_enabled = false;
  status.advertising = false;
  status.usb_interfaces_opened = g_driver_state.interfaces_opened;
  status.usb_report_in_flight = g_driver_state.report_in_flight;
  status.usb_report_dirty = g_driver_state.report_dirty;
  status.usb_control_in_ep = g_driver_state.control_in_ep;
  status.usb_send_attempts = g_send_attempt_count;
  status.usb_send_successes = g_send_success_count;
  status.usb_in_completions = g_in_xfer_complete_count;
  status.usb_in_failures = g_in_xfer_failure_count;
  status.usb_out_completions = g_out_xfer_complete_count;
  return status;
}

#endif
